stm32-hotspot/STM32WBA-BLE-LongRange/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_App_Long_Range_Central/STM32_WPAN/App/app_ble.c
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "LEGACY   |");
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "EXTENDED |");
    }
    
    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%4d | ",(int8_t)p_ext_adv_report->RSSI );
              
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0001))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "CONN |");
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "     |");
    }
    
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0002))
    {
      if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0008))
      {
        l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN RSP |");
      }
      else
      {
        l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN     |");
      }
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "         |");
    }
    
    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%3d | ",p_ext_adv_report->Data_Length );
    
    if (p_ext_adv_report->Advertising_SID != 0xFF)
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%2d | ",p_ext_adv_report->Advertising_SID );
    }
    
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0020))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "more data   | ");
    }
    else if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0040))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "trunc data | ");
    }
    else
    {
      /* Nothing to do */
    }          

    if( !(HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010)) && /* extended */
        (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0001)) )   /* connectable */
    {
      uint8_t i, adtype, adlength;
      
      i = 0;
      while ( i < p_ext_adv_report->Data_Length )
      {
        adlength = p_ext_adv_report->Data[i];
        adtype = p_ext_adv_report->Data[i + 1];
        
        if ( adtype == AD_TYPE_MANUFACTURER_SPECIFIC_DATA )
        {
          if ( (adlength >= 7) && 
               (p_ext_adv_report->Data[i + 4] == 0x02) && /* blueST v2*/
               (p_ext_adv_report->Data[i + 6] == FW_ID_P2P_SERVER_LONG_RANGE))   /* p2pServer Long Range application */
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "Long Range p2pServer detected, address recorded to connect. | ");

            bleAppContext.a_deviceServerExtendedBdAddr[0] = p_ext_adv_report->Address[0];
            bleAppContext.a_deviceServerExtendedBdAddr[1] = p_ext_adv_report->Address[1];
            bleAppContext.a_deviceServerExtendedBdAddr[2] = p_ext_adv_report->Address[2];
            bleAppContext.a_deviceServerExtendedBdAddr[3] = p_ext_adv_report->Address[3];
            bleAppContext.a_deviceServerExtendedBdAddr[4] = p_ext_adv_report->Address[4];
            bleAppContext.a_deviceServerExtendedBdAddr[5] = p_ext_adv_report->Address[5];
            bleAppContext.deviceServerExtendedAddressType = p_ext_adv_report->Address_Type;
            
            APP_DBG_MSG("     - Found Device @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      bleAppContext.a_deviceServerExtendedBdAddr[5],
                      bleAppContext.a_deviceServerExtendedBdAddr[4],
                      bleAppContext.a_deviceServerExtendedBdAddr[3],
                      bleAppContext.a_deviceServerExtendedBdAddr[2],
                      bleAppContext.a_deviceServerExtendedBdAddr[1],
                      bleAppContext.a_deviceServerExtendedBdAddr[0]);
            
            APP_DBG_MSG("Address type %d",bleAppContext.deviceServerExtendedAddressType);
            
            BSP_LED_On(LED_BLUE);

            bleAppContext.deviceServerFound = 0x01;
            if (bleAppContext.deviceServerFound == 1)
              aci_gap_terminate_gap_proc(GAP_GENERAL_DISCOVERY_PROC);
          }
        }
        i += adlength + 1;
      }
    }

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "\n");
   
    APP_DBG_MSG("%s",l_buff);
  }
    
  return status;
}

static void connectRequestExt(void)
{
  tBleStatus result;
  Init_Param_Phy_t Init_Param_Phy[3];
  Init_Param_Phy[0].Scan_Interval       = SCAN_INT_MS(500);
  Init_Param_Phy[0].Scan_Window         = SCAN_WIN_MS(500);
  Init_Param_Phy[0].Conn_Interval_Min   = CONN_INT_MS(20);
  Init_Param_Phy[0].Conn_Interval_Max   = CONN_INT_MS(30);
  Init_Param_Phy[0].Conn_Latency        = 0;
  Init_Param_Phy[0].Supervision_Timeout = CONN_SUP_TIMEOUT_MS(5000);
  Init_Param_Phy[0].Min_CE_Length       = CONN_CE_LENGTH_MS(10);
  Init_Param_Phy[0].Max_CE_Length       = CONN_CE_LENGTH_MS(10);

  BSP_LED_Off(LED_BLUE);
  if (bleAppContext.deviceServerFound != 0x00)
  {
    APP_DBG_MSG("aci_gap_ext_create_connection\n");

    result = aci_gap_ext_create_connection(0x00, GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC,
                                       GAP_PUBLIC_ADDR,
                                       bleAppContext.deviceServerExtendedAddressType, 
                                       &bleAppContext.a_deviceServerExtendedBdAddr[0],
                                       0xFF, 0xFF, 0,
                                       HCI_INIT_PHYS_SCAN_CONN_LE_CODED,
                                       Init_Param_Phy);
    
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
    }
    else
    {
      APP_DBG_MSG("==>> GAP Ext Create connection Failed , result: 0x%02x\n", result);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }

  return;
}

uint8_t connection_update(void)
{
  tBleStatus result;
  Init_Param_Phy_t Init_Param_Phy[3];
  Init_Param_Phy[0].Scan_Interval       = SCAN_INT_MS(500);
  Init_Param_Phy[0].Scan_Window         = SCAN_WIN_MS(500);
  Init_Param_Phy[0].Conn_Interval_Min   = CONN_INT_MS(50);
  Init_Param_Phy[0].Conn_Interval_Max   = CONN_INT_MS(50);
  Init_Param_Phy[0].Conn_Latency        = 0;
  Init_Param_Phy[0].Supervision_Timeout = CONN_SUP_TIMEOUT_MS(5000);
  Init_Param_Phy[0].Min_CE_Length       = CONN_CE_LENGTH_MS(10);
  Init_Param_Phy[0].Max_CE_Length       = CONN_CE_LENGTH_MS(10);
  
  result = aci_gap_start_connection_update(bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                           Init_Param_Phy[0].Conn_Interval_Min, Init_Param_Phy[0].Conn_Interval_Max,
                                           Init_Param_Phy[0].Conn_Latency,
                                           Init_Param_Phy[0].Supervision_Timeout,
                                           Init_Param_Phy[0].Min_CE_Length, Init_Param_Phy[0].Max_CE_Length);
  if (result == BLE_STATUS_SUCCESS)
  {
  }
  else
  {
    APP_DBG_MSG("==>> connection update Failed , result: 0x%02x\n", result);
  }
  
  return result;
}

/* USER CODE END FD_LOCAL_FUNCTION */

